In [1]:
import sqlite3

In [4]:
db = sqlite3.connect('bookbox_jupyter_db')

In [5]:
cursor = db.cursor()

In [6]:
# create database
cursor.execute('''
    CREATE TABLE books(id INTEGER PRIMARY KEY, title CHAR(30), author CHAR(30),
                   qty INTEGER(5))
''')
db.commit()

In [9]:
id1 = 3001
title1 = 'A Tale of Two Cities'
author1 = 'Charles Dickens'
qty1 = 30

# Insert book 1
cursor.execute('''INSERT INTO books(id, title, author, qty)
                  VALUES(?,?,?,?)''', (id1, title1, author1, qty1))
print('First book inserted')

First book inserted

In [10]:
# check database
cursor.execute('''SELECT * FROM books''')
books = cursor.fetchall()

In [11]:
print(books)

[(3001, 'A Tale of Two Cities', 'Charles Dickens', 30)]

In [13]:
id2 = 3002
title2 = "Harry Potter and the Philospher's Stone"
author2 = 'J.K. Rowling'
qty2 = 40

# Insert book 2
cursor.execute('''INSERT INTO books(id, title, author, qty)
                  VALUES(?,?,?,?)''', (id2, title2, author2, qty2))
print('Second book inserted')

First book inserted

In [14]:
id3 = 3003
title3 = "The Lion, the Witch and the Wardrobe"
author3 = 'C.S. Lewis'
qty3 = 25

# Insert book 2
cursor.execute('''INSERT INTO books(id, title, author, qty)
                  VALUES(?,?,?,?)''', (id3, title3, author3, qty3))
print('Third book inserted')

Second book inserted

In [15]:
id4 = 3004
title4 = "The Lord of the Rings"
author4 = 'J.J.R Tolkein'
qty4 = 37

# Insert book 2
cursor.execute('''INSERT INTO books(id, title, author, qty)
                  VALUES(?,?,?,?)''', (id4, title4, author4, qty4))
print('Fourth book inserted')

Fourth book inserted

In [16]:
id5 = 3005
title5 = "Alice in Wonderland"
author5 = 'Lewis Carrol'
qty5 = 12

# Insert book 2
cursor.execute('''INSERT INTO books(id, title, author, qty)
                  VALUES(?,?,?,?)''', (id5, title5, author5, qty5))
print('Fifth book inserted')

Fifth book inserted